{"pageProps":{"title":"Project Plan & Journey","content":"\nThis webpage contains a brief details about project and its journey. After a set of discussions with sir [Dr. Raja Noshad Jamil](/profile/faculity/raja-noshad), following plan is decided:\n\n## Task Breakdown\n\nProject is divided into following two primary phases:\n\n[1. Data Mining, 2. Server Development](/assets/img/content/two-division.png)\n\n1. __Data Mining__: Phase 1 involves dividing, collecting, refining, organizing, centralizing and post-centralization refining of data. It also includes training ai-models to predict/generae responses from queries.\n2. __Server Development__: In Phase 2, an app will be developed using collected data and trained model. A final product will be made ready for users.\n\n### 1. Data Mining\n\nThis phase will be carried out in first 10 weeks. It involves:\n1. Collecting Data from Different Sources (LinkedIn, Published Reports, Available Datasets, Pools, Interviews, etc.)\n2. Refining and Cleaning collected data (duplicates, outliars, nulls, noise, etc.)\n3. Exporting and submitting collected data in a uniform JSON format (Schema will be provided)\n4. Centralizing collected JSON exports to a primary Neo4J graph. It also involves cleaning and processing nodes / edges to ensure integrity of primary graph.\n5. Training Models (ML, DL, NLP) that work on collected data and produce desired output.\n\n### 2. Server Develoment\n\n- Developing an app with following skillset:\n  - Core (AI Models)\n    - Language: Python\n    - Dataset: Neo4J\n  - Web-Server:\n    - Back-End: Laravel\n    - Front-End: ReactJS\n    - Database: Neo4J\n    - Server: InfinityFree (variable)\n- \"Core\" contains AI models executable using workers and Managers. \"Server\" will use Processes and Queue Scheduling to executing Core/workers using system calls.\n- Core members will work on app. Volunteers can participate and will be working close to core-members.\n\n\n## Defining \"Data\"\n\nWhen we say \"we need to mine data\", it refers to following information:\n\n1. __Domains__: Records of all domains / fields existing for career selection. For example, IT, Business, Medical, Aviation, etc.\n2. __Positions__: A big set of all Positions existing in world for every domain. For Example: \"Software Engineer\", \"Accountant\", \"General Surgeon\", \"Pilot\", etc. It involves adding categories, aliases, levels, salary_range, etc. to all these positions. This is the heart of entire graph.\n3. __Skills__: All skills required for every position along with tags for \"required\", \"recommended\", \"optional\", etc.\n4. __Studies and Certifications__: All studies and certificates required for a position with similar tags like #3 (Skills)\n5. __Tools and Platforms__: Different Applications every domain / position uses in daily life. For example develoeprs use \"github\", \"chatgpt\" while designers use \"dribbble\", \"figma\", \"pinterest\", etc.\n6. __Pathway__: This involves determining \"Who gets promoted to what\" for example \"Jr. Software Enginer gets Promoted to Sr. Software Engineer\" and \"Co-Pilots become Pilots\". This involves determining \"all possible pathways\", \"estd. time required for transition\", \"probability changes of transition\" for each edge in graph. (Hint: we can get this information from \"Work History\" of employees from LinkedIn, UpWork, etc.)\n7. __Failures and Successes__: Determining \"this pathway leads to failure\" and \"that pathway leads to success\". It can be extracted out by digging deeper in #6 (pathway) and #2 (positions).\n8. __Communication Style__: There are different terminilogies used in every domain. For examples software engineers say \"SEO\", \"QA\", \"DevOps\" and \"repository\" in their routine talks. Similarly a doctor may use \"ICU\", \"OT\", etc. and a pilots may laugh at \"mayday mayday\" and \"zero altitude\" jokes in their chats. (Hint: We can process posts, comments and bios of different people to extract this information)\n9. __Personality Assessment__: As our final product will operate like a \"chatbot\", users will ask and type different messages. On top of that, they are uploading their CVs and sharing portfolio URLs, we can process those \"text\" to determine user's personality using information we gathered in #8 (Communication Style). We may also use handwriting, facial emotions in video resume, etc. In order to understand this further, two teams will be assigned to meet professional psychiatrists. We shall mark this as \"beta functionality\" of our app. It will not be included in MVP (Minimal Viable Product).\n\n## Data Sources & Methods\n\nFollowing are different sources and techniques one can use to extract data\n\n#### Sources\n\n1. Interviews, Appointments and Sessions (Engage in physical communication in community around you. Data collected this way is usually more informative and authentic)\n2. Questionaires & Surveys\n3. LinkedIn (Messages, Posts, Profiles, Pools, Comments, Jobs)\n4. Other Social Media (Reddit, Twitter, Instagram, etc)\n5. Freelancing Platofrms: UpWork, Freelancer, Fiverr\n6. Job Searching Apps: Google Jobs, Jobee, Rozee, etc.\n7. Platforms (github, pinterest, dribbble, etc. See #5 -- Tools and Platforms)\n8. Research Papers\n9. Publications\n10. Available Datasets\n\n#### Methods / Techniques\n\n1. Manually making sheets, graphs or databases\n2. Using LLMs to summarize textual contents into CSV export. Remember to review & refine later.\n3. Writing Web-Scrapping or Automation scripts for automated data collection (e.g., using requests, BS4, Selenium, xdotool)\n4. Using Image-To-Text models\n\n## Application Architecture\n\nThere are two main parts of application:\n- Core\n- Server\n\n#### Core\n\n> A multi-modular architecture with replacable unit modules.\n\n```txtcore/\n├── src/\n│   ├── models/\n│   │  ├── chat/\n│   │  │   ├── OpenAI.py\n│   │  │   ├── Groq.py\n│   │  │   ├── CustomNLP.py\n│   │  │   └── __init__.py\n│   │  └── skills/\n│   │  │   ├── CustomGPTServices.py\n│   │  │   ├── AIML.py\n│   │  │   ├── HuggingFaceModel.py\n│   │  │   └── __init__.py\n│   ├── managers/\n│   │  ├── ChatManager.py\n│   │  ├── SuccessScoreManager.py\n│   │  └── SkillsRecommendationManager.py\n│   ├── workers/\n│   │  ├── chat_worker.py\n│   │  ├── success_score_worker.py\n│   │  └── skills_recommendation_worker.py\n│   ├── util/\n│   │  ├── classes/\n│   │  │   ├── TTS.py\n│   │  │   ├── STT.py\n│   │  │   ├── Vision.py\n│   │  │   ├── Database2JSON.py\n│   │  │   ├── JSON2Database.py\n│   │  │   └── __init__.py\n│   │  └── functions/\n│   │  │   ├── system_call.py\n│   │  │   ├── json_request.py\n│   │  │   ├── read_file.py\n│   │  │   └── __init__.py\n│   ├── dist/\n│   │  ├── pretrained_models/\n│   │  │   ├── YoloV8.pt\n│   │  │   ├── custom_model.weights\n│   │  │   ├── aiml_skills.brn\n│   │  │   └── __init__.py\n│   │  ├── career_categories.json\n│   │  └── models.json\n│   ├── config/\n│   │  ├── settings.py.py\n│   │  └── database_connection.py\n│   ├── .env\n│   └── main.py\n├── examples/\n├── tests/\n└── docs/\n\n```\n\nSkillset:\n- Python\n- Neo4J Graph\n\nNotes:\n- We have a __modular-structure__ with __replaceable modules__. This means two models for same purpose can be developed. After develoment we can either \"select one and switch other if/when required\" or \"merge models into another combined module\".\n- `models`: These are AI Models\n- `managers`: They are comprehensive classes for using models\n- `workers`: This directory has many executable files organized in sub-directory. Each file representing python-process for one or few api-endpoints.\n\n#### Server\n\n> Runs `core` models. Manages database, jobs and requests.\n\n```txt\nserver/\n├── src/\n│   ├── config/\n│   ├── controllers/\n│   ├── models/\n│   ├── jobs/\n│   ├── database/\n│   │   ├── migrations/\n│   │   └── seeders/\n│   ├── views/\n│   ├── public/\n│   ├── routes/\n│   └── .env\n└── docs/\n\n```\n\n#### App Dev Tasks\n\nAs it is clear in architecture, one can opt out for any of following:\n- AI Engineer: Create AI Models using given interface (interface specifies class name and methods that must be exact. Develoer can maky any number of other methods for develoment. Just a few will be specified)\n- Laravel Developer: For Backend\n- Neo4J Admin: For manaing primary database\n- ReactJS Front-End Dev: To design UI\n\nNote: App Development will start from week-11. During week 1 to 10, only AI Models can be developed along-side data collection.\n\n## Repository\n\nA [github organization](https://github.com/umt-dm) is created.\nRepositores are created and will be added for course-content, project repository, blog and collected data.\n\nHere's a quick introduction to main repositories:\n- [class-project](https://github.com/umt-dm/class-project): This is primary repository where source code of core (ai models), web server and primary graph will be stored. \"read access\" to this repository will be provided to all mates (share your GH Username with core members). Edit access remains restricted to mates. Only Faculity and core-members can make changes to this respository.\n- [course-content](https://github.com/umt-dm/course-content): This repository has study materials for data-mining course.\n- [umt-dm.github.io](https://github.com/umt-dm/umt-dm.github.io): It is repository for this blog. access policy for this repository is same as of [class-project](https://github.com/umt-dm/class-project).\n\n#### Collaboration Notes\n\n- Creating Issues and Discussions are allowed. Additional \"in-class discussion\" and \"WA Group\" support will be provided (as majurity is infamiliar with GH collaboration methods).\n- Forks, pull-requests and merges are allowed to mates or teams assigned specific task\n- Branching is restricted\n- Credits will be given to collaborating members.\n\n## Timeline\n\nFollowing is initial timeline for project.\nUpdated timelines will be poasted with \"announcement tag\".\nKeep checking [Announcements Page](/tag/announcement) for new updates (updated every sunday)\n\n[Project Timeline](/assets/img/content/project-timeline.png)\n","tags":["Announcement"]},"__N_SSG":true}